#include "source.hpp"

#include "Hooking/Hooked.hpp"
#include "Utils/InputSys.hpp"

#include "SDK/Classes/PropManager.hpp"
#include "SDK/Displacement.hpp"

#include "SDK/Classes/Player.hpp"

#include "Features/Visuals/Glow.hpp"
#include "Features/Miscellaneous/GameEvent.hpp"

#include "Renderer/Render.hpp"
#include "Features/Miscellaneous/SkinChanger.hpp"
#include "Features/Miscellaneous/KitParser.hpp"

#include "Hooking/hooker.hpp"

#include "Features/Visuals/CChams.hpp"

#include "Features/Game/Prediction.hpp"
#include "Loader/Exports.h"

#include "Utils/fnv.h"
#include "Utils/lazy_importer.hpp"
#include "Features/Miscellaneous/MusicPlayer.hpp"

#include <fstream>

extern ClientClass* CCSPlayerClass;
extern CreateClientClassFn oCreateCCSPlayer;

#define CONCAT_IMPL( x, y ) x##y
#define MACRO_CONCAT( x, y ) CONCAT_IMPL( x, y )
#define PAD( size ) uint8_t MACRO_CONCAT( _pad, __COUNTER__ )[ size ];

//56 8D 51 3C BE
matrix3x4_t g_HeadBone;

class CParticleCollection;
class C_INIT_RandomColor {
	BYTE pad_0[92];
public:
	Vector	m_flNormColorMin;
	Vector	m_flNormColorMax;
};


using FnProcessInterpolatedList = void( __cdecl* )( );
FnProcessInterpolatedList oProcessInterpolatedList;
void __cdecl hkProcessInterpolatedList( ) {
	g_Vars.globals.szLastHookCalled = XorStr( "38" );
	**( bool** )( Engine::Displacement.Data.s_bAllowExtrapolation ) = false;
	oProcessInterpolatedList( );
}

using FnResetGetWaterContentsForPointCache = void( __thiscall* )( void* );
FnResetGetWaterContentsForPointCache oResetGetWaterContentsForPointCache;
void __fastcall hkResetGetWaterContentsForPointCache( void* ecx, void* edx ) {
	g_Vars.globals.szLastHookCalled = XorStr( "39" );
	if( !Engine::Prediction::Instance( )->InPrediction( ) )
		oResetGetWaterContentsForPointCache( ecx );

	return;
}

matrix3x4_t HeadBone;
unsigned int GetVirtual(void* class_, unsigned int index) { return (unsigned int)(*(int**)class_)[index]; }
#define GetV(x, y) reinterpret_cast<void*>(GetVirtual(x, y))

using FnModifyEyePosition = void( __thiscall* )( C_CSPlayer*, Vector* );
FnModifyEyePosition oModifyEyePoisition;
void __fastcall hkModifyEyePosition( C_CSPlayer* ecx, void* edx, Vector* eye_position ) {
	g_Vars.globals.szLastHookCalled = XorStr( "40" );
	auto local_player = C_CSPlayer::GetLocalPlayer( );
	if( !local_player ) {
		oModifyEyePoisition( ecx, eye_position );
		return;
	}

	if( g_Vars.globals.m_bInCreateMove )
		oModifyEyePoisition( ecx, eye_position );

	return;
};

using FnAddBoxOverlay = void( __thiscall* )( void*, const Vector& origin, const Vector& mins, const Vector& max, QAngle const& orientation, int r, int g, int b, int a, float duration );
FnAddBoxOverlay oAddBoxOverlay;
void __fastcall hkAddBoxOverlay( void* ecx, void* edx, const Vector& origin, const Vector& mins, const Vector& max, QAngle const& orientation, int r, int g, int b, int a, float duration ) {
	g_Vars.globals.szLastHookCalled = XorStr( "41" );

	static uintptr_t fire_bulltes = 0;
	if( !fire_bulltes )
		fire_bulltes = Memory::Scan( XorStr( "client.dll" ), XorStr( "3B 3D ?? ?? ?? ?? 75 4C" ) );

	if( !g_Vars.misc.impacts_spoof || uintptr_t( _ReturnAddress( ) ) != fire_bulltes )
		return oAddBoxOverlay( ecx, origin, mins, max, orientation, r, g, b, a, duration );

	return oAddBoxOverlay( ecx, origin, mins, max, orientation,
		g_Vars.esp.client_impacts.r * 255, g_Vars.esp.client_impacts.g * 255, g_Vars.esp.client_impacts.b * 255, g_Vars.esp.client_impacts.a * 255,
		duration );
}

using FnFireEvents = void( __thiscall* )( void* );
FnFireEvents oFireEvents;
void __fastcall hkFireEvents( void* ecx, void* edx ) {
	g_Vars.globals.szLastHookCalled = XorStr( "42" );
	auto local = C_CSPlayer::GetLocalPlayer( );
	if( local && !local->IsDead( ) ) {
		// get this from CL_FireEvents string "Failed to execute event for classId" in engine.dll
		for( CEventInfo* it{ Interfaces::m_pClientState->m_pEvents( ) }; it != nullptr; it = it->m_next ) {
			if( !it->m_class_id )
				continue;

			// set all delays to instant.
			it->m_fire_delay = 0.f;
		}
	}

	oFireEvents( ecx );
}

using ParticleCollection = void(__thiscall*)(C_INIT_RandomColor* thisPtr, CParticleCollection* pParticles, int start_p, int nParticleCount, int nAttributeWriteMask, void* pContext);
ParticleCollection oRandomColor_InitNewParticlesScalar;

void __fastcall Hooked_RandomColor_InitNewParticlesScalar(C_INIT_RandomColor* thisPtr, void* edx, CParticleCollection* pParticles, int start_p, int nParticleCount, int nAttributeWriteMask, void* pContext) { // https://www.unknowncheats.me/forum/3119811-post19.html
	g_Vars.globals.szLastHookCalled = XorStr("48");
	Vector o_min = thisPtr->m_flNormColorMin;
	Vector o_max = thisPtr->m_flNormColorMax;

	if (g_Vars.esp.molotov_color_enable) {

		const char* mat_name = *(char**)(*(uintptr_t*)((uintptr_t)pParticles + 0x48) + 0x40);
		assert(mat_name);

		switch (fnv::hashRuntime(mat_name))
		{
		case fnv::hash("particle\\fire_burning_character\\fire_env_fire.vmt"):
		case fnv::hash("particle\\fire_burning_character\\fire_env_fire_depthblend.vmt"):
		case fnv::hash("particle\\fire_burning_character\\fire_burning_character_depthblend.vmt"):
		case fnv::hash("particle\\fire_burning_character\\fire_burning_character.vmt"):
		case fnv::hash("particle\\fire_burning_character\\fire_burning_character_nodepth.vmt"):
		case fnv::hash("particle\\particle_flares\\particle_flare_001.vmt"):
		case fnv::hash("particle\\particle_flares\\particle_flare_004.vmt"):
		case fnv::hash("particle\\particle_flares\\particle_flare_004b_mod_ob.vmt"):
		case fnv::hash("particle\\particle_flares\\particle_flare_004b_mod_z.vmt"):
		case fnv::hash("particle\\fire_explosion_1\\fire_explosion_1_bright.vmt"):
		case fnv::hash("particle\\fire_explosion_1\\fire_explosion_1b.vmt"):
		case fnv::hash("particle\\fire_particle_4\\fire_particle_4.vmt"):
		case fnv::hash("particle\\fire_explosion_1\\fire_explosion_1_oriented.vmt"):
			thisPtr->m_flNormColorMin = thisPtr->m_flNormColorMax = g_Vars.esp.molotov_color;
			break;
			//default:
				//printf("%s\n", mat_name);
		}
	}

	oRandomColor_InitNewParticlesScalar(thisPtr, pParticles, start_p, nParticleCount, nAttributeWriteMask, pContext);

	thisPtr->m_flNormColorMin = o_min;
	thisPtr->m_flNormColorMax = o_max;
}

void __fastcall Hooked::hkVoiceData(void* ecx, void* edx, void* msg) {
	g_Vars.globals.szLastHookCalled = XorStr("52");

	if (!msg) {
		oVoiceData(ecx, msg);
		return;
	}

	auto local = C_CSPlayer::GetLocalPlayer();

	struct VoiceDataCustom
	{
		uint32_t xuid_low{};
		uint32_t xuid_high{};
		int32_t sequence_bytes{};
		uint32_t section_number{};
		uint32_t uncompressed_sample_offset{};

		__forceinline uint8_t* get_raw_data()
		{
			return (uint8_t*)this;
		}
	};


	struct CSVCMsg_VoiceData_Legacy
	{
		char pad_0000[8]; //0x0000
		int32_t client; //0x0008
		int32_t audible_mask; //0x000C
		uint32_t xuid_low{};
		uint32_t xuid_high{};
		void* voide_data_; //0x0018
		int32_t proximity; //0x001C
		//int32_t caster; //0x0020
		int32_t format; //0x0020
		int32_t sequence_bytes; //0x0024
		uint32_t section_number; //0x0028
		uint32_t uncompressed_sample_offset; //0x002C

		__forceinline VoiceDataCustom get_data()
		{
			VoiceDataCustom cdata;
			cdata.xuid_low = xuid_low;
			cdata.xuid_high = xuid_high;
			cdata.sequence_bytes = sequence_bytes;
			cdata.section_number = section_number;
			cdata.uncompressed_sample_offset = uncompressed_sample_offset;
			return cdata;
		}
	};

	struct CCLCMsg_VoiceData_Legacy
	{
		uint32_t INetMessage_Vtable; //0x0000
		char pad_0004[4]; //0x0004
		uint32_t CCLCMsg_VoiceData_Vtable; //0x0008
		char pad_000C[8]; //0x000C
		void* data; //0x0014
		uint32_t xuid_low{};
		uint32_t xuid_high{};
		int32_t format; //0x0020
		int32_t sequence_bytes; //0x0024
		uint32_t section_number; //0x0028
		uint32_t uncompressed_sample_offset; //0x002C
		int32_t cached_size; //0x0030

		uint32_t flags; //0x0034

		uint8_t no_stack_overflow[0xFF];

		__forceinline void set_data(VoiceDataCustom* cdata)
		{
			xuid_low = cdata->xuid_low;
			xuid_high = cdata->xuid_high;
			sequence_bytes = cdata->sequence_bytes;
			section_number = cdata->section_number;
			uncompressed_sample_offset = cdata->uncompressed_sample_offset;
		}
	};

	CSVCMsg_VoiceData_Legacy* m = (CSVCMsg_VoiceData_Legacy*)msg;
	int sender_index = m->client + 1;
	VoiceDataCustom data = m->get_data();

	if(!local) {
		oVoiceData(ecx, msg);
		return;
	}

	if(local->EntIndex() == sender_index) {
		oVoiceData(ecx, msg);
		return;
	}

	if (m->format != 0) {
		oVoiceData(ecx, msg);
		return;
	}

	// check if its empty
	if (data.section_number == 0 && data.sequence_bytes == 0 && data.uncompressed_sample_offset == 0) {
		oVoiceData(ecx, msg);
		return;
	}

	//const char* formatter = {
	//		"CSVCMsg_VoiceData_Legacy : \n"
	//		"   client                     : %d\n"
	//		"   audible_mask               : %d\n"
